app/Models/M_berita.php

    public function ambilData($id_berita = false)
    {
        if($id_berita === false){
            return $this->db->table($this->table)->get()->getResult();
        }else{
            return $this->getWhere(['id_berita' => $id_berita]);
---
SELECT *
FROM `berita`
SELECT *
FROM `berita`
WHERE `id_berita` = '12'