app/Models/M_chat.php

    public function simpan($data)
    {
        $simpan = $this->db->table($this->table);
        return $simpan->insert($data);
---
INSERT INTO `chat` (`tujuan`, `id_user`, `aksi`, `urutan`, `pesan`) VALUES ('13', '9', '2', 1658485569, 'ddd')