app/Models/M_daftar.php

SELECT *
FROM `pendaftaran`
JOIN `user` ON `user`.`id_user`=`pendaftaran`.`id_user`
JOIN `poli` ON `poli`.`id_poli`=`pendaftaran`.`id_poli`
WHERE `pendaftaran`.`id_poli` = '6'
---
    public function filterpoli($id)
    {
        return $this->db->table($this->table)
            ->join('user', 'user.id_user=pendaftaran.id_user')
            ->join('poli', 'poli.id_poli=pendaftaran.id_poli')
            ->where(['pendaftaran.id_poli' => $id])->get()->getResult();