app/Models/M_dokter.php

SELECT *
FROM `dokter`
SELECT *
FROM `dokter`
WHERE `id_dokter` = '5'
---
    public function ambilData($id_dokter = false)
    {
        if($id_dokter === false){
            return $this->db->table($this->table)->get()->getResult();
        }else{
            return $this->getWhere(['id_dokter' => $id_dokter]);