app/Models/M_dokter.php

SELECT *
FROM `dokter`
JOIN `poli` ON `poli`.`id_poli` = `dokter`.`id_poli`
JOIN `jadwal` ON `jadwal`.`id_jadwal` = `dokter`.`id_jadwal`
SELECT *
FROM `dokter`
JOIN `poli` ON `poli`.`id_poli` = `dokter`.`id_poli`
JOIN `jadwal` ON `jadwal`.`id_jadwal` = `dokter`.`id_jadwal`
WHERE `id_dokter` = '6'
---
    public function ambilData($id_dokter = false)
    {
        if ($id_dokter === false) {
            return $this->db->table($this->table)
                ->join('poli', 'poli.id_poli = dokter.id_poli')
                ->join('jadwal', 'jadwal.id_jadwal = dokter.id_jadwal')
                ->get()->getResult();
        } else {
            return $this->db->table($this->table)
                ->join('poli', 'poli.id_poli = dokter.id_poli')
                ->join('jadwal', 'jadwal.id_jadwal = dokter.id_jadwal')
                ->getWhere(['id_dokter' => $id_dokter]);