app/Models/M_jadwal.php

    public function ambilData($id_jadwal = false)
    {
        if($id_jadwal === false){
            return $this->db->table($this->table)->get()->getResult();
---
SELECT *
FROM `jadwal`