app/Models/M_pasien.php

SELECT *
FROM `pasien`
WHERE `id_pasien` = '2'
---
    public function ambilData($id_pasien = false)
    {
        if ($id_pasien === false) {
            return $this->db->table($this->table)->get()->getResult();
        } else {
            return $this->getWhere(['id_pasien' => $id_pasien]);

DELETE FROM `pasien`
WHERE `id_pasien` = '2'
---
    public function hapus($id_pasien)
    {
        $hapus = $this->db->table($this->table);
        return $hapus->delete(['id_pasien' => $id_pasien]);