app/Models/M_poli.php

    public function ambilData($id_poli = false)
    {
        if($id_poli === false){
            return $this->db->table($this->table)->get()->getResult();
---
SELECT *
FROM `poli`