app/Models/M_review.php

SELECT *
FROM `review`
JOIN `user` ON `user`.`id_user` = `review`.`id_user`
---
    public function ambilData()
    {
        return $this->db->table($this->table)
            ->join('user', 'user.id_user = review.id_user')->get()->getResult();