app/Models/M_user.php

SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `id_user` = '4'
---
    public function ambilData($id_user = false)
    {
        if($id_user === false){
            return $this->db->table($this->table)->get()->getResult();
        }else{
            return $this->getWhere(['id_user' => $id_user]);

DELETE FROM `user`
WHERE `id_user` = '4'
---
    public function hapus($id_user)
    {
    $hapus = $this->db->table($this->table);
    return $hapus->delete(['id_user' => $id_user]);